iscle/Watch_nRF52840/src/displayapp/screens/Clock.cpp
          tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(tempCValue, "--");
          lv_label_set_style(tempCValue, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, -25, 40);
          break;
        case Modes::LowBattery:         
          batteryController.setGoToSleep(true);  
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &lowbattery);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, 0, 10); 
          timeoutCountStart = xTaskGetTickCount();

          tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(tempCValue, "--");
          lv_label_set_style(tempCValue, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, -20, 40);
          break;

        case Modes::Oxi:
          heartRateSensor.SpO2Init();  
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &oxi);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, 0, 10);

          heartbeatValue = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(heartbeatValue, "--");
          lv_label_set_style(heartbeatValue,LV_LABEL_STYLE_MAIN,&labelStyle);
          lv_obj_align(heartbeatValue, lv_scr_act(), LV_ALIGN_IN_BOTTOM_MID, -10, -65); 

          labelpoint  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(labelpoint, &pointoxi);
          lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, 0); 

          break;
        case Modes::Temp:
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &temp);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, 0, -35);

          tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_auto_realign(tempCValue, true);
          lv_label_set_text(tempCValue, "--");
          lv_label_set_style( tempCValue,LV_LABEL_STYLE_MAIN,&labelStyle);
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, 50, 55);

          tempFValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_auto_realign(tempFValue, true);
          lv_label_set_text(tempFValue, "--");
          lv_label_set_style( tempFValue,LV_LABEL_STYLE_MAIN,&labelStyle);
          lv_obj_align( tempFValue,lv_scr_act(), LV_ALIGN_CENTER, -50, 55);

          labelpoint  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(labelpoint, &pointtemp);
          lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, 0); 

          lableftemp  = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(lableftemp , &ftemp);
          lv_obj_align(lableftemp , nullptr, LV_ALIGN_CENTER, -50, 85);


          lablectemp  = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(lablectemp , &ctemp);
          lv_obj_align(lablectemp , nullptr, LV_ALIGN_CENTER, 50, 85);
          heartRateSensor.HrInit();
          timeoutCountStart = xTaskGetTickCount();
          rawTemp=35.5f + (rand()% 3)/10.0f ;


          break;
        default:
          break;
    }
 }

Clock::~Clock() {
  lv_obj_clean(lv_scr_act());
  //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
  batteryController.setcheckVibrate(false);
  batteryController.setisButtonPushed(false);
  heartRateSensor.Disable(); 
  //tempSensor.stop();
}

bool Clock::Refresh() {
    auto month =dateTimeController.Month();
    auto day = dateTimeController.Day();
    auto dayOfWeek = dateTimeController.DayOfWeek();
    auto hour =  dateTimeController.Hours();  
    auto minute =  dateTimeController.Minutes();  
    char timeStr[5];
    sprintf(timeStr, "%02d:%02d", static_cast<int>(hour), static_cast<int>(minute));     
        
    auto batteryPercent = batteryController.PercentRemaining();
    if(batteryPercent<25) lv_img_set_src(batteryIcon, &battery_05);
    else if(batteryPercent<50) lv_img_set_src(batteryIcon, &battery_20);
    else if(batteryPercent<75) lv_img_set_src(batteryIcon, &battery_50);
    else lv_img_set_src(batteryIcon, &battery_100);
    char strBat[4];
    sprintf (strBat, "%d", uint8_t(batteryPercent));
    //bool isCharging = batteryController.IsCharging();//||batteryController.IsPowerPresent();
    if(batteryController.IsCharging()){
      lv_obj_set_hidden(batteryPlug,false);
    } else lv_obj_set_hidden(batteryPlug,true);

    if (bleController.IsConnected()) { lv_img_set_src(bleIcon, &bluetooth);} 
    else { lv_img_set_src(bleIcon, &bluetoothdis); }  
  
    lv_obj_align(batteryIcon, lv_scr_act(), LV_ALIGN_IN_TOP_RIGHT, -5, 5);
    lv_obj_align(bleIcon, batteryIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0);
    lv_obj_align(batteryPlug, bleIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0);

  switch (mode)  {
  case Modes::Clock: 
    char dateStr[15];
    sprintf(dateStr, "%s, %s %d", DayOfWeekToString(dayOfWeek),MonthToString(month),day);
    lv_label_set_text(label_date, dateStr); 
    lv_label_set_text(label_time, timeStr); 
  if((xTaskGetTickCount()-timeoutCountStart) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;
    break;
  case Modes::Test:
      timeout=xTaskGetTickCount()-timeoutCountStart; 
      if((timeout>1*1024) & !checkTest) { 
      if(batteryController.PercentRemaining()<25) batteryController.setButtonDataNoVibrate(0x05); 
      else batteryController.setButtonDataNoVibrate(0x06);  
      checkTest=true;                 
    }
    if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;

    break; 
    case Modes::CheckIn:   

    if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;

